#### Dependencies and Setup
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# File to Load 
salary_data= "./data/salary_data_states.csv"

salary_data = pd.read_csv(./data/salary_data_states.csv')
# Read School and Student Data File and store into Pandas Data Frames
salary_data = pd.read_csv(salary_to_load)

In [21]:

import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns
import sqlite3




salary_data = pd.read_csv('/Users/louisperruchon/documents/project_ds311/data/salary_data_states (2).csv', sep=";")

In [22]:
salary_data_df.head()

,CASE_NUMBER,CASE_STATUS,CASE_RECEIVED_DATE,DECISION_DATE,EMPLOYER_NAME,PREVAILING_WAGE_SUBMITTED,PREVAILING_WAGE_SUBMITTED_UNIT,PAID_WAGE_SUBMITTED,PAID_WAGE_SUBMITTED_UNIT,JOB_TITLE,...,PREVAILING_WAGE_SOC_TITLE,WORK_STATE,WORK_STATE_ABBREVIATION,WORK_POSTAL_CODE,FULL_TIME_POSITION_Y_N,VISA_CLASS,PREVAILING_WAGE_PER_YEAR,PAID_WAGE_PER_YEAR,JOB_TITLE_SUBGROUP,order
0,I-200-14073-248840,denied,3/14/2014,3/21/2014,"ADVANCED TECHNOLOGY GROUP USA, INC.",6217100,year,62171,year,SOFTWARE ENGINEER,...,"Software Developers, Applications",Illinois,IL,NaN,y,H-1B,NaN,62171,software engineer,1
1,A-15061-55212,denied,3/19/2015,3/19/2015,SAN FRANCISCO STATE UNIVERSITY,5067600,year,91440,year,Assistant Professor of Marketing,...,"Business Teachers, Postsecondary",California,CA,94132.0,NaN,greencard,NaN,91440,assistant professor,2
2,I-200-13256-001092,denied,9/13/2013,9/23/2013,CAROUSEL SCHOOL,4947000,year,49470,year,SPECIAL EDUCATION TEACHER,...,"Special Education Teachers, Kindergarten and E...",California,CA,NaN,y,H-1B,NaN,49470,teacher,3
3,I-200-14087-353657,denied,3/28/2014,4/7/2014,HARLINGEN CONSOLIDATED INDEPENDENT SCHOOL DIST...,251052.00,month,43800,year,SCIENCE TEACHER,...,"Biological Science Teachers, Postsecondary",Texas,TX,NaN,y,H-1B,NaN,43800,teacher,4
4,I-203-14259-128844,denied,9/16/2014,9/23/2014,SIGNAL SCIENCES CORPORATION,84573.00,bi-weekly,170000,year,SENIOR SOFTWARE ENGINEER,...,"Software Developers, Systems Software",Oregon,OR,NaN,y,E-3 Australian,NaN,170000,software engineer,5

In [23]:
salary_data.describe()

       EXPERIENCE_REQUIRED_NUM_MONTHS          order
count                     4965.000000  167278.000000
mean                        34.692044   83714.716305
std                         22.317783   48300.236431
min                          0.000000       1.000000
25%                         12.000000   41901.250000
50%                         24.000000   83722.500000
75%                         60.000000  125541.750000
max                        144.000000  167361.000000

In [24]:
salary_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 167278 entries, 0 to 167277
Data columns (total 27 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   CASE_NUMBER                     167278 non-null  object
 1   CASE_STATUS                     167278 non-null  object
 2   CASE_RECEIVED_DATE              167278 non-null  object
 3   DECISION_DATE                   167278 non-null  object
 4   EMPLOYER_NAME                   167278 non-null  object
 5   PREVAILING_WAGE_SUBMITTED       167278 non-null  object
 6   PREVAILING_WAGE_SUBMITTED_UNIT  167278 non-null  object
 7   PAID_WAGE_SUBMITTED             167278 non-null  object
 8   PAID_WAGE_SUBMITTED_UNIT        167278 non-null  object
 9   JOB_TITLE                       167278 non-null  object
 10  WORK_CITY                       167275 non-null  object
 11  EDUCATION_LEVEL_REQUIRED        11093 non-null   object
 12  COLLEGE_MAJOR_REQUIRED          11051 non-null   object
 13  EXPERIENCE_REQUIRED_Y_N         11093 non-null   object
 14  EXPERIENCE_REQUIRED_NUM_MONTHS  4965 non-null    float64
 15  COUNTRY_OF_CITIZENSHIP          11093 non-null   object
 16  PREVAILING_WAGE_SOC_CODE        167278 non-null  object
 17  PREVAILING_WAGE_SOC_TITLE       167278 non-null  object
 18  WORK_STATE                      167278 non-null  object
 19  WORK_STATE_ABBREVIATION         167278 non-null  object
 20  WORK_POSTAL_CODE                53674 non-null   object
 21  FULL_TIME_POSITION_Y_N          156185 non-null  object
 22  VISA_CLASS                      167278 non-null  object
 23  PREVAILING_WAGE_PER_YEAR        167210 non-null  object
 24  PAID_WAGE_PER_YEAR              167278 non-null  object
 25  JOB_TITLE_SUBGROUP              167278 non-null  object
 26  order                           167278 non-null  int64
dtypes: float64(1), int64(1), object(25)
memory usage: 34.5+ MB

In [25]:
salary_data['PREVAILING_WAGE_SUBMITTED'].tail()

167273    5.05
167274    5,05
167275    5,05
167276    5,05
167277    5,05
Name: PREVAILING_WAGE_SUBMITTED, dtype: object

In [26]:

salary_data['PAID_WAGE_SUBMITTED']

0          62171
1          91440
2          49470
3          43800
4         170000
           ...
167273       5.6
167274      5,25
167275      5,25
167276       5,1
167277      5,05
Name: PAID_WAGE_SUBMITTED, Length: 167278, dtype: object

In [27]:
salary_data['COUNTRY_OF_CITIZENSHIP']

0          NaN
1         IRAN
2          NaN
3          NaN
4          NaN
          ...
167273     NaN
167274     NaN
167275     NaN
167276     NaN
167277     NaN
Name: COUNTRY_OF_CITIZENSHIP, Length: 167278, dtype: object

In [28]:
type(salary_data['COUNTRY_OF_CITIZENSHIP'])

pandas.core.series.Series

In [35]:
def countX(lst, x):
    count = 0
    for ele in lst:
        if (ele == x):
            count = count + 1
    
    return count
countX(salary_data['COUNTRY_OF_CITIZENSHIP'],'NA')

0

In [38]:
RON\SQLEXPRESS

SyntaxError: unexpected character after line continuation character (<ipython-input-38-a318c5dd730f>, line 1)

In [39]:
# project step 1

import pyodbc


con = pyodbc.connect('Driver={TDBDR};'
                      'Server=server_sqlary'
                      'Database=salary_database;'
                      'Trusted_Connection=yes;')
cursor = conn.cursor()
cursor.execute('''
        CREATE TABLE salary (
        CASE_NUMBER VARCHAR,
        CASE_STATUS VARCHAR,
        CASE_RECEIVED_DATE VARCHAR,
        DECISION_DATE VARCHAR,
        EMPLOYER_NAME VARCHAR,
        PREVAILING_WAGE_SUBMITTED VARCHAR,
        PREVAILING_WAGE_SUBMITTED_UNIT VARCHAR,
        PAID_WAGE_SUBMITTED VARCHAR,
        PAID_WAGE_SUBMITTED_UNIT VARCHAR,
        JOB_TITLE VARCHAR,
        WORK_CITY VARCHAR,
        EDUCATION_LEVEL_REQUIRED VARCHAR,
        COLLEGE_MAJOR_REQUIRED VARCHAR,
        EXPERIENCE_REQUIRED_Y_N VARCHAR,
        EXPERIENCE_REQUIRED_NUM_MONTHS FLOAT,
        COUNTRY_OF_CITIZENSHIP VARCHAR,
        PREVAILING_WAGE_SOC_CODE VARCHAR,
        PREVAILING_WAGE_SOC_TITLE VARCHAR,
        WORK_STATE VARCHAR,
        WORK_STATE_ABBREVIATION VARCHAR,
        WORK_POSTAL_CODE VARCHAR,
        FULL_TIME_POSITION_Y_N VARCHAR,
        VISA_CLASS VARCHAR,
        PREVAILING_WAGE_PER_YEAR VARCHAR,
        PAID_WAGE_PER_YEAR VARCHAR,
        JOB_TITLE_SUBGROUP VARCHAR,
        order int primary key
        
        
        )
               ''')


cursor.execute(query_salary_data_states)

Error: ('01000', "[01000] [unixODBC][Driver Manager]Can't open lib 'TDBDR' : file not found (0) (SQLDriverConnect)")

In [31]:

pd.read_sql("""

SELECT*, 
FROM query_salary_data_states

""", con)

DatabaseError: Execution failed on sql '

SELECT*,
FROM query_salary_data_states

': near "FROM": syntax error